In [2]:
import pandas as pd
import numpy as np

In [15]:
import seaborn as sns

In [13]:
b1 = pd.read_excel('bike_info1.xlsx')
b1.head(3)

  대여소 그룹                           대여소 명  대여 일자 / 월  대여 건수
0    강남구                2301. 현대고등학교 건너편     201912    501
1    강남구  2302. 교보타워 버스정류장(신논현역 3번출구 후면)     201912    737
2    강남구                  2303. 논현역 7번출구     201912    460

In [16]:
b1.columns

Index(['대여소 그룹', '대여소 명', '대여 일자 / 월', '대여 건수'], dtype='object')

In [19]:
type(b1['대여 일자 / 월'][0])

numpy.int64

In [20]:
# '대여 일자 / 월'이 201912인 데이터를 삭제
b1 = b1[b1['대여 일자 / 월'] != 201912]

In [21]:
b1.head(3)

      대여소 그룹                           대여소 명  대여 일자 / 월  대여 건수
1544  그룹명 없음                         대여소명 없음     202001      0
1545     강남구                2301. 현대고등학교 건너편     202001    577
1546     강남구  2302. 교보타워 버스정류장(신논현역 3번출구 후면)     202001    690

In [42]:
b1.shape

(8459, 4)

In [ ]:
# pivot_table - value, index, column
# 예) df.pivot_table('인구','도시','연도')

In [37]:
b1_gp = b1.groupby(['대여소 그룹','대여 일자 / 월'])[['대여 건수']].sum()
#b1_gp[b1_gp['대여소 그룹'] == '강남구']
b1_gp.head()

                  대여 건수
대여소 그룹 대여 일자 / 월
강남구    202001     31431
       202002     28331
       202003     62298
       202004     79071
       202005     85286

In [39]:
b1df = pd.pivot_table(b1,                # 피벗할 데이터프레임
                     index = '대여소 그룹',    # 행 위치에 들어갈 열
                     columns = '대여 일자 / 월',    # 열 위치에 들어갈 열
                     values = '대여 건수',     # 데이터로 사용할 열
                     aggfunc = 'sum')   # 데이터 집계함수
b1df

대여 일자 / 월  202001  202002  202003  202004  202005
대여소 그룹
강남구         31431   28331   62298   79071   85286
강동구         28792   27770   56628   80264   98402
강북구         14683   14242   28364   40569   46427
강서구         55764   55341   97810  147332  189362
관악구         27351   25933   43517   72232   80649
광진구         46804   44635   92565  122092  137370
구로구         29983   28625   49774   79379   91446
그룹명 없음          0       0       0       0       0
금천구         13567   13702   22246   34358   38569
노원구         40903   38809   73885  107261  131637
도봉구         13306   13388   27421   40425   48501
동대문구        29029   28871   51020   73049   84798
동작구         17618   17756   38381   56976   63900
마포구         51398   50303  113159  150045  171563
서대문구        24660   23660   45906   60953   65045
서초구         32903   31664   68120   88766   99591
성동구         37398   38067   83262  110733  118660
성북구         26336   26149   50483   73591   80223
송파구         62836   58719  129609  171219  201721
양천구         26312   26070   48425   76366   94049
영등포구        61116   61170  139285  189786  218138
용산구         14920   15230   37433   53377   58936
은평구         25908   24496   47689   67062   76128
정비센터           42      59     333     480     285
종로구         39067   35087   55086   76187   78984
중구          21265   19491   31836   45691   47577
중랑구         20755   19701   39377   60129   73082

In [12]:
b2 = pd.read_excel('bike_info2.xlsx')
b2.head(3)

  대여소 그룹                           대여소 명  대여 일자 / 월  대여 건수
0    강남구                2301. 현대고등학교 건너편     202006   4512
1    강남구  2302. 교보타워 버스정류장(신논현역 3번출구 후면)     202006   1650
2    강남구                  2303. 논현역 7번출구     202006   1134

In [11]:
b3 = pd.read_csv('bike_info3.csv',encoding='EUC-KR')
b3.head(3)

  대여소 그룹                           대여소 명  대여 일자 / 월  대여 건수
0    강남구                2301. 현대고등학교 건너편     202007   3997
1    강남구  2302. 교보타워 버스정류장(신논현역 3번출구 후면)     202007   1250
2    강남구                  2303. 논현역 7번출구     202007    863

In [43]:
b1.shape

(8459, 4)

In [44]:
b2.shape

(2062, 4)

In [45]:
b12=pd.concat([b1,b2],axis=0)
b12.shape

(10521, 4)

In [47]:
b3.shape

(14754, 4)

In [46]:
b123=pd.concat([b12,b3],axis=0)
b123.shape

(25275, 4)

In [56]:
df = pd.pivot_table(b123,                # 피벗할 데이터프레임
                     index = '대여소 그룹',    # 행 위치에 들어갈 열
                     columns = '대여 일자 / 월',    # 열 위치에 들어갈 열
                        values = '대여 건수',     # 데이터로 사용할 열
                     aggfunc = 'sum')   # 데이터 집계함수
df.head()

대여 일자 / 월,202001,202002,202003,202004,202005,202006,202007,202008,202009,202010,202011,202012,202101
대여소 그룹,,,,,,,,,,,,,
강남구,31431.0,28331.0,62298.0,79071.0,85286.0,92905.0,79194.0,49049.0,88713.0,90032.0,62709.0,38004.0,24706.0
강동구,28792.0,27770.0,56628.0,80264.0,98402.0,111698.0,97719.0,60519.0,103564.0,103328.0,67591.0,42373.0,26158.0
강북구,14683.0,14242.0,28364.0,40569.0,46427.0,54179.0,54503.0,34282.0,54362.0,56250.0,40715.0,24392.0,16101.0
강서구,55764.0,55341.0,97810.0,147332.0,189362.0,232192.0,224984.0,171772.0,254450.0,273746.0,185484.0,104049.0,75019.0
관악구,27351.0,25933.0,43517.0,72232.0,80649.0,101026.0,92451.0,64692.0,98095.0,99149.0,68117.0,41420.0,27457.0

In [57]:
df["합계"] = df.sum(axis=1)
df.head()

대여 일자 / 월,202001,202002,202003,202004,202005,202006,202007,202008,202009,202010,202011,202012,202101,합계
대여소 그룹,,,,,,,,,,,,,,
강남구,31431.0,28331.0,62298.0,79071.0,85286.0,92905.0,79194.0,49049.0,88713.0,90032.0,62709.0,38004.0,24706.0,811729.0
강동구,28792.0,27770.0,56628.0,80264.0,98402.0,111698.0,97719.0,60519.0,103564.0,103328.0,67591.0,42373.0,26158.0,904806.0
강북구,14683.0,14242.0,28364.0,40569.0,46427.0,54179.0,54503.0,34282.0,54362.0,56250.0,40715.0,24392.0,16101.0,479069.0
강서구,55764.0,55341.0,97810.0,147332.0,189362.0,232192.0,224984.0,171772.0,254450.0,273746.0,185484.0,104049.0,75019.0,2067305.0
관악구,27351.0,25933.0,43517.0,72232.0,80649.0,101026.0,92451.0,64692.0,98095.0,99149.0,68117.0,41420.0,27457.0,842089.0

In [58]:
df.sort_values(by=['합계'],ascending=False).head()

대여 일자 / 월,202001,202002,202003,202004,202005,202006,202007,202008,202009,202010,202011,202012,202101,합계
대여소 그룹,,,,,,,,,,,,,,
강서구,55764.0,55341.0,97810.0,147332.0,189362.0,232192.0,224984.0,171772.0,254450.0,273746.0,185484.0,104049.0,75019.0,2067305.0
영등포구,61116.0,61170.0,139285.0,189786.0,218138.0,228956.0,209515.0,141204.0,232092.0,234372.0,153138.0,93726.0,64359.0,2026857.0
송파구,62836.0,58719.0,129609.0,171219.0,201721.0,218677.0,185529.0,108922.0,206157.0,210041.0,137216.0,85064.0,54819.0,1830529.0
마포구,51398.0,50303.0,113159.0,150045.0,171563.0,182316.0,155009.0,106361.0,178507.0,171919.0,110104.0,66393.0,48660.0,1555737.0
노원구,40903.0,38809.0,73885.0,107261.0,131637.0,161660.0,157281.0,97412.0,150696.0,155531.0,112320.0,66005.0,41994.0,1335394.0